#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/tokyo-crafter/proxy-dev/runs/run-616HDdpAoVMpQFuf

Waiting for the plan to start...

Terraform v1.1.3
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.lightsail-cluster.local_file.private_key: Refreshing state... [id=7aa97c5d1368ac8353e1ee5e0fe71c00490b7570]
module.lightsail-cluster.aws_lightsail_key_pair.ssh-key: Refreshing state... [id=ssh_key_pair]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.lightsail-cluster.local_file.private_key has been deleted
  - resource "local_file" "private_key" {
      - directory_permission = "0777" -> null
      - file_permission      = "0777" -> null
      - filename             = "./ssh/private_key.pem" -> null
      - id                   = "7aa97c5d1368ac8353e1ee5e0fe71c00490b7570" -> null
      - sensitive_content    = (sensitive value)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lightsail-cluster.aws_lightsail_key_pair.ssh-key must be replaced
-/+ resource "aws_lightsail_key_pair" "ssh-key" {
      ~ arn                   = "arn:aws:lightsail:ap-northeast-1:781550338764:KeyPair/f8e742e3-afa0-4bd8-b72e-3d76c1c14367" -> (known after apply)
      + encrypted_fingerprint = (known after apply)
      + encrypted_private_key = (known after apply)
      ~ fingerprint           = "90:2e:9a:b8:81:85:9c:0e:61:f3:cb:15:4e:57:b0:b4" -> (known after apply)
      ~ id                    = "ssh_key_pair" -> (known after apply)
        name                  = "ssh_key_pair"
      + private_key           = (known after apply)
      ~ public_key            = <<-EOT # forces replacement
          - MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAoZNzEiRso6rRspSBksB4
          - duWx84MtARYZhtlUGTZkJccX2MEjp7e4OIRZNd5JVnoyd9L75OLRYS/v2jXpB5zb
          - pcslB+I8AJHPueM83niI1k1RqG7Usu3W8dGJs+xgbXsxPJv0Fvs1a0LgXSsD5+dF
          - wpJpDcOYplq1zi+ovP1XVLdJV8OUqGOloa8ramtM/Uh8i/OZF8i1wBVQZwi0pNNp
          - crTL83/SHhqGlusqvAxo9/S8e1ehalz86JpQapnO6ka6sKo/24Bwvt1jZ1ZPqBV8
          - oWQ8DFL9Aj6Or3lJ4KkQixOrjBJjRyns5v6l15moJl+XbhkpafdcU2AF2TlGt+H+
          - 5wIDAQAB
          + MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAoZNzEiRso6rRspSBksB4duWx84MtARYZhtlUGTZkJccX2MEjp7e4OIRZNd5JVnoyd9L75OLRYS/v2jXpB5zbpcslB+I8AJHPueM83niI1k1RqG7Usu3W8dGJs+xgbXsxPJv0Fvs1a0LgXSsD5+dFwpJpDcOYplq1zi+ovP1XVLdJV8OUqGOloa8ramtM/Uh8i/OZF8i1wBVQZwi0pNNpcrTL83/SHhqGlusqvAxo9/S8e1ehalz86JpQapnO6ka6sKo/24Bwvt1jZ1ZPqBV8oWQ8DFL9Aj6Or3lJ4KkQixOrjBJjRyns5v6l15moJl+XbhkpafdcU2AF2TlGt+H+5wIDAQAB
        EOT
    }

  # module.lightsail-cluster.local_file.private_key will be created
  + resource "local_file" "private_key" {
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./ssh/private_key.pem"
      + id                   = (known after apply)
      + sensitive_content    = (sensitive value)
    }

Plan: 2 to add, 0 to change, 1 to destroy.


```

</details>

*Pusher: @taigacat, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*